package hw3.sorter;

/**
 Написать класс, который  должен  постоянно с заданной частотой считывать
 и сортировать содержимое файла.
 public void sort()

 Частота считывания задается в конфигурационном файле conf.properties.
 Для считывания конфигурационного файла создать отдельный класс Config, который будет хранить конфигурационные параметры.
 Класс Config создать по шаблону "Singleton".
 В процессе работы сортировщика пользователь должен иметь возможность менять алгоритм сортировки (по возрастанию, убыванию)

 Классы задания:
 hw3.sorter.DynamicSorter
 hw3.sorter.Config

 Класс теста:
 hw3.sorter.DynamicSorterTest
 */
public class DynamicSorterTest {
}
