package hw3.parallel;

/**
 Реализовать в классе MyArrayList метод
 public int parallelIndexOf(E e), выполняющий линейный многопоточный поиск в списке.
 В тестах проверить поиск:
 - существующего элемента
 - не существующего элемента
 - не существующего элемента в пустом массиве
 - не существующего элемента в массиве с одним элементом
 - существующего элемента в массиве с одним элементом
 - элемента со значением null

 Класс задания:
 hw3.parallel.MyArrayList

 Класс теста:
 hw3.parallel.MyArrayListTest
 */
public class MyArrayListTest {
}
