package hw4.parallel;

/**
 Написать многопоточный поиск в файловой системе. Пользователь вводит путь к папке и имя файла. Вывести на экран те пути, где найден файл.
 В тестах проверить поиск:
 - по существующему пути, 3х существующих файлов на разных уровнях (1,2,3)
 - по существующему пути, несуществующего файла
 - по несуществующему пути, несуществующего файла
 - единственного существующего файла в единственном каталоге

 Класс задания:
 FileFinder

 Класс теста:
 FileFinderTest
 */


public class FileFinderTest {

}