package hw3.parallel;

/**
 * Created by vladimir on 27.01.2015.
 *
 * Реализовать в классе MyArrayList метод
 * public int parallelIndexOf(E e), выполняющий линейный
 * многопоточный поиск в списке.
 *
 * Примечание: в списке может быть несколько подходящих элементов.
 * Поиск должен останавливаться при первом нахождении.
 *
 * В тестах проверить поиск:
 * - существующего элемента
 * - несуществующего элемента
 * - несуществующего элемента в пустом массиве
 * - несуществующего элемента в массиве с одним элементом
 * - существующего элемента в массиве с одним элементом
 * - элемента со значением null
 *
 * Класс задания:
 * hw3.parallel.MyArrayList
 *
 * Класс теста:
 * hw3.parallel.MyArrayListTest
 */
public class MyArrayList {
    public int parallelIndexOf(E e) {

        return 0;
    }
}
